[
  {
    "id": 1,
    "title": "Complete React.js Masterclass",
    "description": "Go from zero to hero with React. Learn hooks, state management, router, and build real-world applications in this comprehensive guide.",
    "instructorId": 101,
    "lessons": [
      {
        "id": 101,
        "title": "Introduction to React & JSX",
        "content": "Welcome! In this lesson, we explore why React is so popular. We will set up our environment using Vite and write our first line of JSX. You'll learn how JSX differs from HTML."
      },
      {
        "id": 102,
        "title": "Components and Props",
        "content": "React is built on components. Learn how to create functional components and pass dynamic data between them using Props to make your UI reusable."
      },
      {
        "id": 103,
        "title": "State Management with useState",
        "content": "State is the memory of your component. We dive deep into the useState hook to handle user input, toggles, and counters."
      },
      {
        "id": 104,
        "title": "Handling Side Effects with useEffect",
        "content": "Learn how to fetch data from APIs and interact with the browser DOM outside of the React render cycle using the useEffect hook."
      },
      {
        "id": 105,
        "title": "React Router Dom Basics",
        "content": "Single Page Applications need navigation. We will implement client-side routing to switch between pages without refreshing the browser."
      },
      {
        "id": 106,
        "title": "Forms and User Input",
        "content": "Handling forms in React can be tricky. We will learn about controlled components vs uncontrolled components and how to validate inputs."
      },
      {
        "id": 107,
        "title": "Context API for Global State",
        "content": "Prop drilling is annoying. Learn how to use the Context API to share state like 'User Auth' or 'Theme' across your entire application easily."
      },
      {
        "id": 108,
        "title": "Custom Hooks",
        "content": "Don't repeat yourself! We will extract logic into custom hooks to make our code cleaner and more modular."
      },
      {
        "id": 109,
        "title": "Performance Optimization",
        "content": "Learn about React.memo, useMemo, and useCallback to prevent unnecessary re-renders and keep your app snappy."
      },
      {
        "id": 110,
        "title": "Deployment to Vercel",
        "content": "Congratulations on finishing the code! Now, let's build the production bundle and deploy our app to the web using Vercel."
      }
    ]
  },
  {
    "id": 2,
    "title": "Node.js Backend Architecture",
    "description": "Master the backend with Node.js. Learn Express, database connections, authentication, and how to structure scalable APIs.",
    "instructorId": 102,
    "lessons": [
      {
        "id": 201,
        "title": "The Node.js Event Loop",
        "content": "Understanding the non-blocking I/O model. We visualize the Call Stack, Node APIs, and the Event Loop queue."
      },
      {
        "id": 202,
        "title": "Modules and NPM",
        "content": "Learn the difference between CommonJS and ES Modules. We also explore NPM to manage third-party packages."
      },
      {
        "id": 203,
        "title": "Building a Server with Express",
        "content": "Setting up a basic HTTP server using Express.js. We cover routing, request methods (GET, POST), and status codes."
      },
      {
        "id": 204,
        "title": "Middleware Functions",
        "content": "Middleware is the heart of Express. Learn how to write logging, parsing, and error-handling middleware."
      },
      {
        "id": 205,
        "title": "REST API Design Standards",
        "content": "Best practices for naming routes, versioning APIs, and structuring JSON responses for a professional backend."
      },
      {
        "id": 206,
        "title": "Connecting to MongoDB (Mongoose)",
        "content": "We connect our Node app to a NoSQL database. Learn schemas, models, and basic CRUD operations with Mongoose."
      },
      {
        "id": 207,
        "title": "Authentication with JWT",
        "content": "Secure your API. We implement registration and login using bcrypt for password hashing and JSON Web Tokens for sessions."
      },
      {
        "id": 208,
        "title": "Input Validation",
        "content": "Never trust user input. We use libraries like Zod or Joi to validate incoming data before it hits our database."
      },
      {
        "id": 209,
        "title": "File Uploads with Multer",
        "content": "Learn how to handle multipart/form-data to allow users to upload profile pictures and documents to your server."
      },
      {
        "id": 210,
        "title": "Unit Testing with Jest",
        "content": "Ensure your API is reliable. We write unit tests for our controllers and integration tests for our API endpoints."
      }
    ]
  },
  {
    "id": 3,
    "title": "PostgreSQL Database Design",
    "description": "Learn SQL from scratch. Design normalized schemas, write complex queries, and understand indexing for high-performance databases.",
    "instructorId": 103,
    "lessons": [
      {
        "id": 301,
        "title": "Relational Database Concepts",
        "content": "What is a table? What is a row? We cover primary keys, foreign keys, and the basics of relational theory."
      },
      {
        "id": 302,
        "title": "Basic SQL Queries",
        "content": "SELECT, INSERT, UPDATE, DELETE. We practice the foundational commands to manipulate data."
      },
      {
        "id": 303,
        "title": "Filtering and Sorting",
        "content": "Using WHERE clauses, ORDER BY, LIMIT, and OFFSET to find exactly the data you need."
      },
      {
        "id": 304,
        "title": "Database Normalization",
        "content": "How to structure your data to avoid redundancy. We explain 1NF, 2NF, and 3NF with real-world examples."
      },
      {
        "id": 305,
        "title": "Joins Mastery",
        "content": "Visualizing INNER JOIN, LEFT JOIN, RIGHT JOIN, and FULL JOIN. Connecting data across multiple tables."
      },
      {
        "id": 306,
        "title": "Aggregation and Grouping",
        "content": "Using COUNT, SUM, AVG, and GROUP BY to generate reports and analytics from your raw data."
      },
      {
        "id": 307,
        "title": "Indexes and Performance",
        "content": "Why is my query slow? We learn how B-Tree indexes work and when (and when not) to add them."
      },
      {
        "id": 308,
        "title": "ACID Transactions",
        "content": "Ensuring data integrity. We learn about Atomicity, Consistency, Isolation, and Durability using BEGIN and COMMIT."
      },
      {
        "id": 309,
        "title": "Stored Procedures",
        "content": "Writing functions directly in the database using PL/pgSQL to encapsulate complex logic."
      },
      {
        "id": 310,
        "title": "Backups and Restoration",
        "content": "Disaster recovery. How to use pg_dump to backup your data and restore it if the server crashes."
      }
    ]
  },
  {
    "id": 4,
    "title": "UI/UX Design Fundamentals",
    "description": "Design apps that users love. Learn wireframing, color theory, typography, and how to use Figma to create stunning prototypes.",
    "instructorId": 104,
    "lessons": [
      {
        "id": 401,
        "title": "Introduction to Design Thinking",
        "content": "Empathize, Define, Ideate, Prototype, Test. The 5 stages of the design process explained."
      },
      {
        "id": 402,
        "title": "Wireframing vs Prototyping",
        "content": "Low fidelity sketches vs High fidelity interactive mockups. When to use which."
      },
      {
        "id": 403,
        "title": "Figma Crash Course",
        "content": "Getting around the interface. Frames, layers, vectors, and the pen tool basics."
      },
      {
        "id": 404,
        "title": "Color Theory & Psychology",
        "content": "Choosing a palette. Understanding complementary colors, contrast ratios, and emotional impact."
      },
      {
        "id": 405,
        "title": "Typography Rules",
        "content": "Serif vs Sans Serif. Line height, kerning, and hierarchy. How to make text readable."
      },
      {
        "id": 406,
        "title": "Spacing and Grids",
        "content": "Using the 8pt grid system. Understanding negative space (whitespace) to let your design breathe."
      },
      {
        "id": 407,
        "title": "Component Libraries",
        "content": "Creating reusable buttons, inputs, and cards in Figma using Auto Layout and Variants."
      },
      {
        "id": 408,
        "title": "User Research Methods",
        "content": "How to conduct user interviews, create personas, and map out user journeys."
      },
      {
        "id": 409,
        "title": "Accessibility (a11y)",
        "content": "Designing for everyone. Color blindness simulation, screen reader considerations, and WCAG guidelines."
      },
      {
        "id": 410,
        "title": "Developer Handoff",
        "content": "How to prepare your design file for engineers so they can code it pixel-perfectly."
      }
    ]
  },
  {
    "id": 5,
    "title": "DevOps with Docker & Kubernetes",
    "description": "Stop saying 'it works on my machine'. Containerize your apps and orchestrate them for massive scale.",
    "instructorId": 105,
    "lessons": [
      {
        "id": 501,
        "title": "Virtual Machines vs Containers",
        "content": "Why Docker changed the world. Understanding the OS kernel, images, and containers."
      },
      {
        "id": 502,
        "title": "Writing a Dockerfile",
        "content": "Containerizing a Node.js app. FROM, WORKDIR, COPY, RUN, and CMD commands explained."
      },
      {
        "id": 503,
        "title": "Docker Compose",
        "content": "Orchestrating multi-container environments (App + Database) locally with a single YAML file."
      },
      {
        "id": 504,
        "title": "Docker Networking",
        "content": "How containers talk to each other. Bridge networks, host networks, and port mapping."
      },
      {
        "id": 505,
        "title": "Intro to Kubernetes (K8s)",
        "content": "Moving from one server to a cluster. The architecture of the Control Plane and Worker Nodes."
      },
      {
        "id": 506,
        "title": "Pods and Services",
        "content": "The atomic unit of K8s. Deploying a Pod and exposing it to the internet via a Service."
      },
      {
        "id": 507,
        "title": "ReplicaSets and Deployments",
        "content": "Ensuring high availability. Self-healing, scaling replicas, and rolling updates."
      },
      {
        "id": 508,
        "title": "ConfigMaps and Secrets",
        "content": "Managing environment variables and sensitive keys securely in a cluster."
      },
      {
        "id": 509,
        "title": "CI/CD Pipelines",
        "content": "Automating the build and push process using GitHub Actions or GitLab CI."
      },
      {
        "id": 510,
        "title": "Monitoring and Logging",
        "content": "Observability basics. Using Prometheus and Grafana to visualize cluster health."
      }
    ]
  },
  {
    "id": 6,
    "title": "Mobile Dev with React Native",
    "description": "Build native iOS and Android apps using JavaScript. Learn navigation, device features, and publishing to the App Store.",
    "instructorId": 106,
    "lessons": [
      {
        "id": 601,
        "title": "Expo vs CLI",
        "content": "Setting up the environment. Why we choose Expo for rapid development and when to eject."
      },
      {
        "id": 602,
        "title": "Core Components",
        "content": "View, Text, Image, ScrollView. Translating HTML mental models to Native components."
      },
      {
        "id": 603,
        "title": "Styling with Flexbox",
        "content": "React Native doesn't have CSS. Learn how to layout screens using the Flexbox algorithm."
      },
      {
        "id": 604,
        "title": "React Navigation",
        "content": "Stack Navigator, Tab Navigator, and Drawer. Moving between screens and passing params."
      },
      {
        "id": 605,
        "title": "Device APIs (Camera & Location)",
        "content": "Accessing hardware features. Asking for permissions and taking a photo."
      },
      {
        "id": 606,
        "title": "Handling Lists",
        "content": "Rendering large datasets efficiently using FlatList and SectionList."
      },
      {
        "id": 607,
        "title": "AsyncStorage",
        "content": "Persisting data locally on the device for offline capabilities."
      },
      {
        "id": 608,
        "title": "Animations",
        "content": "Making it feel smooth. Using the Animated API and Reanimated library for gestures."
      },
      {
        "id": 609,
        "title": "Push Notifications",
        "content": "Engaging users. Setting up Expo Notifications service."
      },
      {
        "id": 610,
        "title": "App Store Submission",
        "content": "Generating certificates, signing the .apk/.ipa, and navigating the review process."
      }
    ]
  },
  {
    "id": 7,
    "title": "Data Structures & Algorithms",
    "description": "Crack the coding interview. Master Big O notation, trees, graphs, sorting, and dynamic programming in JavaScript.",
    "instructorId": 107,
    "lessons": [
      {
        "id": 701,
        "title": "Big O Notation",
        "content": "Time and Space complexity. Analyzing algorithms: O(1), O(n), O(log n), O(n^2)."
      },
      {
        "id": 702,
        "title": "Arrays and Strings",
        "content": "Sliding Window technique and Two Pointers. Solving common interview problems."
      },
      {
        "id": 703,
        "title": "Hash Maps",
        "content": "Key-value pairs. Handling collisions and understanding O(1) lookups."
      },
      {
        "id": 704,
        "title": "Linked Lists",
        "content": "Singly and Doubly linked lists. Reversing a list and detecting cycles (Floyd's algorithm)."
      },
      {
        "id": 705,
        "title": "Stacks and Queues",
        "content": "LIFO vs FIFO. Implementing a stack using arrays and solving bracket matching problems."
      },
      {
        "id": 706,
        "title": "Trees and Traversal",
        "content": "Binary Search Trees (BST). DFS (Pre, In, Post-order) vs BFS traversal."
      },
      {
        "id": 707,
        "title": "Heaps and Priority Queues",
        "content": "Min-Heap vs Max-Heap. Implementing efficient sorting and finding the Kth largest element."
      },
      {
        "id": 708,
        "title": "Graphs",
        "content": "Adjacency Matrix vs List. Breadth-First Search and Depth-First Search on graphs."
      },
      {
        "id": 709,
        "title": "Dynamic Programming",
        "content": "Memoization and Tabulation. Solving the Fibonacci sequence and Climbing Stairs."
      },
      {
        "id": 710,
        "title": "Sorting Algorithms",
        "content": "Bubble Sort (bad) vs Merge Sort and Quick Sort (good). Divide and conquer strategies."
      }
    ]
  },
  {
    "id": 8,
    "title": "Python for Absolute Beginners",
    "description": "The perfect language to start coding. Learn syntax, automation, and data manipulation in this friendly introduction.",
    "instructorId": 108,
    "lessons": [
      {
        "id": 801,
        "title": "Installing Python & IDLE",
        "content": "Setting up Python 3. Running your first 'Hello World' script."
      },
      {
        "id": 802,
        "title": "Variables and Data Types",
        "content": "Integers, Floats, Strings, and Booleans. Dynamic typing in Python."
      },
      {
        "id": 803,
        "title": "Control Flow",
        "content": "Making decisions with If, Elif, Else. Using comparisons and logical operators."
      },
      {
        "id": 804,
        "title": "Loops",
        "content": "For loops and While loops. Iterating over ranges and lists."
      },
      {
        "id": 805,
        "title": "Functions",
        "content": "Defining functions with `def`. Arguments, return values, and scope."
      },
      {
        "id": 806,
        "title": "Lists and Dictionaries",
        "content": "Working with collections. Slicing lists and accessing dictionary keys."
      },
      {
        "id": 807,
        "title": "Object Oriented Programming (OOP)",
        "content": "Classes and Objects. `__init__`, methods, and inheritance basics."
      },
      {
        "id": 808,
        "title": "Modules and PIP",
        "content": "Importing standard libraries (`math`, `random`) and installing external packages."
      },
      {
        "id": 809,
        "title": "File I/O",
        "content": "Reading from and writing to text files and CSVs using `open()`."
      },
      {
        "id": 810,
        "title": "Error Handling",
        "content": "Try, Except, Finally blocks. Preventing your program from crashing."
      }
    ]
  },
  {
    "id": 9,
    "title": "Machine Learning Basics",
    "description": "An intro to AI. Learn about regression, classification, neural networks, and how to use Scikit-Learn.",
    "instructorId": 109,
    "lessons": [
      {
        "id": 901,
        "title": "AI vs ML vs Deep Learning",
        "content": "Demystifying the buzzwords. What is the difference and history of the field?"
      },
      {
        "id": 902,
        "title": "Supervised vs Unsupervised",
        "content": "Labeled vs Unlabeled data. Classification vs Clustering problems."
      },
      {
        "id": 903,
        "title": "Pandas for Data Analysis",
        "content": "Dataframes and Series. Cleaning data and handling missing values."
      },
      {
        "id": 904,
        "title": "Linear Regression",
        "content": "Predicting a number. Fitting a line to data points. Mean Squared Error."
      },
      {
        "id": 905,
        "title": "Logistic Regression",
        "content": "Predicting a category (Yes/No). The Sigmoid function and probability."
      },
      {
        "id": 906,
        "title": "Decision Trees",
        "content": "Visualizing decisions. Entropy and Information Gain. Random Forests."
      },
      {
        "id": 907,
        "title": "Model Evaluation",
        "content": "Train/Test split. Confusion Matrix, Accuracy, Precision, and Recall."
      },
      {
        "id": 908,
        "title": "K-Means Clustering",
        "content": "Grouping similar data points together without labels."
      },
      {
        "id": 909,
        "title": "Intro to Neural Networks",
        "content": "Neurons, Weights, Biases. The concept of the Perceptron."
      },
      {
        "id": 910,
        "title": "Building a Model with Scikit-Learn",
        "content": "Putting it all together. Loading a dataset, training a model, and making predictions."
      }
    ]
  },
  {
    "id": 10,
    "title": "Digital Marketing Strategy",
    "description": "Grow your business online. Master SEO, Social Media, Content Marketing, and Analytics.",
    "instructorId": 110,
    "lessons": [
      {
        "id": 1001,
        "title": "The Marketing Funnel",
        "content": "Awareness, Interest, Desire, Action. Mapping the customer journey."
      },
      {
        "id": 1002,
        "title": "SEO Fundamentals",
        "content": "On-page vs Off-page SEO. Keywords, meta tags, and backlinks."
      },
      {
        "id": 1003,
        "title": "Content Marketing",
        "content": "Blogging and Video. Creating value to attract an audience."
      },
      {
        "id": 1004,
        "title": "Social Media Strategy",
        "content": "Choosing the right platform. Instagram vs LinkedIn vs TikTok strategies."
      },
      {
        "id": 1005,
        "title": "Email Marketing",
        "content": "Building a list. Segmentation, automation, and writing high-converting subject lines."
      },
      {
        "id": 1006,
        "title": "PPC Advertising (Google Ads)",
        "content": "Pay Per Click basics. Bidding strategies, quality score, and ad copy."
      },
      {
        "id": 1007,
        "title": "Facebook & Instagram Ads",
        "content": "Targeting audiences. Custom audiences, lookalikes, and pixel tracking."
      },
      {
        "id": 1008,
        "title": "Google Analytics 4",
        "content": "Measuring success. Users, Sessions, Bounce Rate, and Conversion tracking."
      },
      {
        "id": 1009,
        "title": "Branding and Identity",
        "content": "Voice, Tone, and Visuals. Consistency across channels."
      },
      {
        "id": 1010,
        "title": "Growth Hacking",
        "content": "Creative, low-cost strategies to acquire users rapidly."
      }
    ]
  }
]
